InformationRegisters/СомнительныеСитуации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СомнительныеСитуации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СомнительнаяСитуация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСомнительныхСитуаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подтвержена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СомнительныеСитуации/Ext/ManagerModule.bsl
Процедура Зарегистрировать(СомнительнаяСитуация,Заказ,Значение=Неопределено,Пользователь=Неопределено) Экспорт

	НоваяСтрока					= СоздатьМенеджерЗаписи();
	НоваяСтрока.Дата			= ТекущаяДата();
	НоваяСтрока.СомнительнаяСитуация = СомнительнаяСитуация;
	Если Заказ<>Неопределено Тогда
		НоваяСтрока.Заказ		= Заказ.Ссылка;
	КонецЕсли;
	Если Пользователь<>Неопределено Тогда
		НоваяСтрока.Пользователь = Пользователь;
	Иначе
		НоваяСтрока.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли; 
	НоваяСтрока.Компьютер		= ПараметрыСеанса.ТекущийКомпьютер; //ПолучитьСерверТО().ПолучитьКомпьютерТО();
	НоваяСтрока.Значение		= Значение;
	НоваяСтрока.Идентификатор	= Новый УникальныйИдентификатор;
	НоваяСтрока.Записать(Ложь);
	
	ОбменДанными.ПередатьСомнительнуюСитуацию(НоваяСтрока);
	
КонецПроцедуры

//Костенюк Александр-Старт 12.11.2012
// Функция формирует табличный документ с печатной формой 
//
// Параметры:
// ДатаНачала - Тип: Дата. Дата начала периода выборки данных.
// ДатаОкончания - Тип: Дата. Дата окончания периода выборки данных.
// Возвращаемое значение:
// ТабДокумент - Тип: ТабличныйДокумент. Сформированная печатная форма.
//
Функция Печать(ДатаНачала, ДатаОкончания, РежимПечати) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СомнительныеСитуации.Идентификатор,
	               |	СомнительныеСитуации.Дата КАК Дата,
	               |	СомнительныеСитуации.СомнительнаяСитуация,
	               |	СомнительныеСитуации.Подтвержена,
	               |	СомнительныеСитуации.Пользователь,
	               |	СомнительныеСитуации.Компьютер,
	               |	СомнительныеСитуации.Заказ,
	               |	СомнительныеСитуации.Значение
	               |ИЗ
	               |	РегистрСведений.СомнительныеСитуации КАК СомнительныеСитуации
	               |ГДЕ
	               |	СомнительныеСитуации.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И СомнительныеСитуации.Подтвержена = &Подтвержена
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	
	Если РежимПечати = "Неподтвержденные" Тогда
		Запрос.УстановитьПараметр("Подтвержена", Ложь);
	ИначеЕсли РежимПечати = "Подтвержденные" Тогда
		Запрос.УстановитьПараметр("Подтвержена", Истина);
	ИначеЕсли РежимПечати = "Все" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СомнительныеСитуации.Подтвержена = &Подтвержена", "ИСТИНА");
	КонецЕсли;

	Запрос.УстановитьПараметр("ДатаНачала"		, ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"	, ДатаОкончания);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СомнительныеСитуации";
	
	Макет = ПолучитьМакет("Макет");
	
	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	ОбластьМакетаЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакетаШапкаТаблицы 	= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьМакетаСтрока 		= Макет.ПолучитьОбласть("Строка");
	ОбластьМакетаПодвал 		= Макет.ПолучитьОбласть("Подвал");
	
	ОбластьМакетаЗаголовок.Параметры.ДатаНачала 	= ДатаНачала;
	ОбластьМакетаЗаголовок.Параметры.ДатаОкончания 	= ДатаОкончания;
	ТабДокумент.Вывести(ОбластьМакетаЗаголовок);
	ТабДокумент.Вывести(ОбластьМакетаШапкаТаблицы);
	
	НомерСтроки = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		ОбластьМакетаСтрока.Параметры.НомерСтроки = НомерСтроки;
		ОбластьМакетаСтрока.Параметры.Заполнить(Выборка);
		ОбластьМакетаСтрока.Параметры.Пользователь = СокрЛП(Строка(Выборка.Пользователь));
		ТабДокумент.Вывести(ОбластьМакетаСтрока);
		
	КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДокумент;
	
КонецФункции
//Костенюк Александр-Финиш 12.11.2012
